Checks if a point was used to define the first profile.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public bool HasFirstProfilePoint()
  Visual Basic
Public Function HasFirstProfilePoint As Boolean
  Visual C++
public:
bool HasFirstProfilePoint()
 Return Value
 True if a point was used to define the first profile, false otherwise.
 See Also
  RuledSurface Class
  Autodesk.Revit.DB Namespace